---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.AreaBasedLoadBoundaryLineData
source: html/b852c297-3549-69f4-4fee-0e0963be34e7.htm
---
# AreaBasedLoadBoundaryLineData Methods

Returns level ids between the top level and the bottom level (including the top level and the bottom level) of
 the area based load boundary line.